---
kind: property
id: P:Autodesk.Revit.DB.SymbolicCurveArray.Item(System.Int32)
source: html/d04d6ea4-1469-61a9-ddbf-1e48d89da625.htm
---
# Autodesk.Revit.DB.SymbolicCurveArray.Item Property

Gets or sets a model curve at a specified index within the array.

## Syntax (C#)
```csharp
public virtual SymbolicCurve this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the model curve to be set or retrieved.

## Returns
Returns the model curve at the specified index.